verificationAndValidation/atmosphericModels/atmForestStability/setups.orig/common/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p_rgh
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-15;
        relTol          0.1;
        maxIter         10;
    }

    "(U|k|epsilon|omega)"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-12;
        relTol          0.1;
    }

    T
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-15;
        relTol          0.1;
        maxIter         10;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    pRefCell    0;
    pRefValue   0;
}

relaxationFactors
{
    fields
    {
        p_rgh           0.15;
    }
    equations
    {
        U               0.1;
        k               0.3;
        omega           0.3;
        epsilon         0.3;
        T               0.015;
    }
}

cache
{
    grad(U);
}


// ************************************************************************* //
